configuration/src/Catalogs/ExtensionObjectIDs/ExtensionObjectIDs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExtensionObjectIDs</name>
  <comment>APK: 304-No. 697.1.2 updating predefined data instead of Auto, you need to set Do not update automatically, because predefined elements are mapped to data programmatically</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>CollectionOrder</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <comment>For Example, &quot;Objectualization&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Synonym</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <comment>For Example, &quot;Provideguarantees.Objectarraylist&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullSynonym</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NoData</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmptyRefValue</name>
    <comment>APK:1330-No. 728.2.1 it is Acceptable to use a universal reference type, since this is a universal mechanism and there is little data</comment>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>MetadataObjectKey</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>NewRef</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>ExtensionName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExtensionID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>38</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExtensionHashsum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/ExtensionVersionObjectIDs/ExtensionVersionObjectIDs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExtensionVersionObjectIDs</name>
  <dimensions>
    <name>ExtensionsVersion</name>
    <type>
      <types>CatalogRef.ExtensionsVersions</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FullObjectName</name>
    <comment>For Example, &quot; Processing.Zapolnennuyu&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Id</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ExtensionObjectIDs/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Not MobileStandaloneServer Then

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.BatchEditObjects

// Returns object attributes that can be edited using the bulk attribute modification data processor.
// 
//
// Returns:
//  Array of String
//
Function AttributesToEditInBatchProcessing() Export
	
	Return Catalogs.MetadataObjectIDs.AttributesToEditInBatchProcessing();
	
EndFunction

// End StandardSubsystems.BatchEditObjects

// SaaSTechnology.ExportImportData

// Returns the catalog attributes that naturally form a catalog item key.
//
// Returns:
//  Array of String - Array of attribute names used to generate a natural key.
//
Function NaturalKeyFields() Export
	
	Return Catalogs.MetadataObjectIDs.NaturalKeyFields();
	
EndFunction

// End SaaSTechnology.ExportImportData

#EndRegion

#EndRegion

#EndIf

#Region EventsHandlers

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	Catalogs.MetadataObjectIDs.PresentationFieldsGetProcessing(Fields,
		StandardProcessing);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	Catalogs.MetadataObjectIDs.PresentationGetProcessing(Data,
		Presentation, StandardProcessing);
	
EndProcedure

#EndRegion

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Function DataTablesFullNames() Export
	
	Tables = New Array;
	
	If Not ValueIsFilled(SessionParameters.AttachedExtensions) Then
		Return Tables;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("ExtensionsVersion", SessionParameters.ExtensionsVersion);
	Query.Text =
	"SELECT TOP 1
	|	TRUE AS TrueValue
	|FROM
	|	InformationRegister.ExtensionVersionObjectIDs AS IDsVersions
	|WHERE
	|	IDsVersions.ExtensionsVersion = &ExtensionsVersion
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	IDsVersions.FullObjectName AS FullObjectName
	|FROM
	|	InformationRegister.ExtensionVersionObjectIDs AS IDsVersions
	|WHERE
	|	IDsVersions.ExtensionsVersion = &ExtensionsVersion
	|	AND IDsVersions.Id.NoData = FALSE";
	
	QueryResults = Query.ExecuteBatch();
	
	If QueryResults[0].IsEmpty() Then
		Catalogs.MetadataObjectIDs.IsDataUpdated(True, True);
		QueryResults = Query.ExecuteBatch();
	EndIf;
	
	Return QueryResults[1].Unload().UnloadColumn("FullObjectName");
	
EndFunction

#EndRegion

#Region Private

// This procedure updates catalog data using the configuration metadata.
//
// Parameters:
//  HasChanges  - Boolean - a return value). True is returned
//                   to this parameter if changes are saved. Otherwise, not modified.
//
//  HasDeletedItems  - Boolean - a return value. Receives
//                   True if a catalog item was marked
//                   for deletion. Otherwise, not modified.
//
//  IsCheckOnly - Boolean - make no changes, just set
//                   the HasChanges and HasDeleted flags.
//
Procedure UpdateCatalogData(HasChanges = False, HasDeletedItems = False, IsCheckOnly = False) Export
	
	Catalogs.MetadataObjectIDs.RunDataUpdate(HasChanges,
		HasDeletedItems, IsCheckOnly, , , True);
	
EndProcedure

// Returns True if the metadata object,
// which the extension object ID corresponds to, exists in the catalog,
// does not have the deletion mark but is absent from the extension metadata cache.
//
// Parameters:
//  Id - CatalogRef.ExtensionObjectIDs - the ID
//                    of a metadata object in an extension.
//
// Returns:
//  Boolean - 
//
Function ExtensionObjectDisabled(Id) Export
	
	StandardSubsystemsCached.MetadataObjectIDsUsageCheck(True, True);
	
	Query = New Query;
	Query.SetParameter("Ref", Id);
	Query.SetParameter("ExtensionsVersion", SessionParameters.ExtensionsVersion);
	
	Query.Text =
	"SELECT TOP 1
	|	TRUE AS TrueValue
	|FROM
	|	Catalog.ExtensionObjectIDs AS IDs
	|WHERE
	|	IDs.Ref = &Ref
	|	AND NOT IDs.DeletionMark
	|	AND NOT TRUE IN
	|				(SELECT TOP 1
	|					TRUE
	|				FROM
	|					InformationRegister.ExtensionVersionObjectIDs AS IDsVersions
	|				WHERE
	|					IDsVersions.Id = IDs.Ref
	|					AND IDsVersions.ExtensionsVersion = &ExtensionsVersion)";
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

// For internal use only.
Function CurrentVersionExtensionObjectIDsFilled() Export
	
	Query = New Query;
	Query.SetParameter("ExtensionsVersion", SessionParameters.ExtensionsVersion);
	Query.Text =
	"SELECT TOP 1
	|	TRUE AS TrueValue
	|FROM
	|	InformationRegister.ExtensionVersionObjectIDs AS IDsVersions
	|WHERE
	|	IDsVersions.ExtensionsVersion = &ExtensionsVersion";
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

#EndRegion

#EndIf

#EndIf
